<template>
  <UiFlex column>
    <div>
      Научный подход к тренировкам основан на принципах физиологии, биомеханики и спортивной медицины. Например,
      доказано, что прогрессивная нагрузка стимулирует рост мышц и силы.
    </div>

    <div><b>Для достижения результата важны:</b></div>

    <ul>
      <li>Полная амплитуда движений</li>
      <li>Периодические подходы до отказа</li>
      <li>Упражнения, в которых мышцы получают нагрузку в момент растяжения</li>
      <li>Подбор веса и повторов по своим возможностям (если легко выполнить 3×20 — увеличивайте вес)</li>
    </ul>

    <div>
      <b>
        Эффективные упражнения, рекомендованные экспертами, сгруппированы по группам мышц и подобраны для баланса
        простоты и разнообразия тренировок.</b
      >
    </div>

    <ImageScience />
  </UiFlex>
</template>

<script setup lang="ts">
import { UiFlex } from 'mhz-ui';

import ImageScience from '@/common/images/science.svg';
</script>
