<template>
  <UiFlex column>
    <div>
      В календаре c примером пользовательских данных можно посмотреть визуализацию тренировки, её состав, время
      подходов, скопировать информацию о тренировке в буфер обмена, например, для отчёта тренеру.
    </div>

    <div>
      Ниже общие и средние данные за месяц по длительности тренировок, количеству занятий, подходов, повторов, времени
      отдыха. Графики с динамикой по занятиям, подходам, повторам и группам мышц.
    </div>

    <div>
      В таблице статистика по упраженениям: выполненные подходы и повторы за последний месяц, сравнение с прошлым
      месяцем, среднее время выполнения. Кликнув по упражнению можно почитать о задействованных группах мышц, требуемом
      оборудовании, технике выполнения.
    </div>
  </UiFlex>
</template>

<script setup lang="ts">
import { UiFlex } from 'mhz-ui';
</script>
