<template>
  <UiFlex column gap="16">
    <h1>Помощь</h1>

    <div>
      <p>
        FiT - бесплатное PWA приложение с
        <a href="https://github.com/dergunovs/fit" target="_blank" rel="nofollow noreferrer noopener"
          >открытым исходным кодом</a
        >
        для трекинга результатов домашних тренировок. Видео про разработку приложения доступно в
        <a href="https://vkvideo.ru/playlist/15313879_11" target="_blank" rel="nofollow noreferrer noopener">VK</a> и
        <a href="https://youtube.com/@dergunovalexandr" target="_blank" rel="nofollow noreferrer noopener">Youtube</a>.
      </p>

      <p>По любым вопросам, багам и предложениям пишите на <a href="mailto:mail@app-fit.ru">mail@app-fit.ru</a>.</p>
    </div>

    <h3>Установка</h3>

    <div>
      <p>
        На Android и ПК установка через ссылку в верхнем меню. Также приложение можно установить через браузер (Google
        Chrome, в iOS - Safari):
      </p>

      <p>
        <b>Android</b>: зайдите на сайт app-fit.ru, войдите в меню браузера ⋮ и выберите "Добавить на главный экран".
      </p>

      <p><b>iOS</b>: зайдите на сайт app-fit.ru, нажмите иконку "Поделиться" и выберите "Добавить на главный экран".</p>

      <p><b>ПК</b>: зайдите на сайт app-fit.ru, в адресной строке браузера нажмите кнопку "Установить".</p>
    </div>

    <h3>Регистрация и профиль</h3>

    <div>
      <p>
        Зарегистрируйтесь, введя своё имя, почту и пароль. На почту придёт ссылка с подтверждением регистрации.
        Проверьте спам, если письма нет.
      </p>

      <p>
        Войдите в приложение. В профиле добавьте доступное для вас оборудование из списка. От этого зависит список
        упражнений, которые вы сможете выполнять. У некоторого оборудования есть выбор веса. Например, у вас могут быть
        гантели 2 и 3 кг.
      </p>

      <p>
        Если в упражнении возможен выбор веса или у вас несколько видов оборудования с весом, появится возможность
        выбора веса по-умолчания для каждого из таких упражнений. Сохраните данные, нажав кнопку "Сохранить".
      </p>
    </div>

    <h3>Прохождение занятия</h3>

    <div>
      <p>
        Добавьте упражнения с учётом количества повторов и доступного веса. Можно добавлять сразу по 2 или 3 подхода.
        Есть фильтр по группам мышц и названию упражнений.
      </p>

      <p>
        Если вы выполнили хотя бы одно занятие, то появится возможность повторить прошлое занятие в один клик. Также вы
        можете повторить любое из выполненных ранее занятий через календарь на странице статистики, нажав на кнопку
        "Сформировать такое же занятие" внизу всплывающего окна.
      </p>

      <p>
        После формирования занятия нажмите кнопку "Начать занятие". Появится экран прохождения занятия. Нажмите
        "Начать", чтобы запустить таймер текущего упражнения. Если вы чувствуете, что подход выполнен до отказа, то
        отметьте это. Вы можете скорректировать количество выполненных повторений. После этого нажмите кнопку
        "Завершить".
      </p>

      <p>
        После выполнения упражнений вы будете перенаправлены на страницу со статистикой. Если по какой-то причине вы не
        можете продолжать занятие, то можно завершить его досрочно, нажав по соответствующей кнопке.
      </p>

      <p>
        Использование таймера позволяет прогнозировать время выполнения будущих занятий, отслеживать среднее время
        отдыха, а также наглядно отображать занятия в статистике.
      </p>
    </div>

    <h3>Планируемая функциональность</h3>

    <div>
      <p>
        Приложение на раннем этапе разработки. Его функциональность будет существенно расширена. Тем не менее, вы уже
        можете им пользоваться, сохраняя данные своих тренировок.
      </p>

      <p>В планах внедрение функциональности:</p>

      <ul>
        <li>объединение подходов в сеты;</li>
        <li>планирование будущих тренировок (на неделю, месяц);</li>
        <li>добавление своих упражнений;</li>
        <li>корректировка веса, использованного в подходе;</li>
        <li>редактирование занятия в процессе его прохождения;</li>
        <li>цветовая индикация занятий по группам мышц в таблице;</li>
        <li>тип пользователя "Тренер", с возможностью планировать тренировки подопечных;</li>
        <li>оффлайн-режим;</li>
        <li>таймер времени отдыха;</li>
      </ul>
    </div>

    <h3>Известные проблемы</h3>

    <p>
      На iOS не работает запрет блокировки экрана при прохождении тренировки. Нужно разблокировать вручную или
      выставлять время блокировки экрана дольше вашего времени подхода.
    </p>
  </UiFlex>
</template>

<script setup lang="ts">
import { onMounted } from 'vue';
import { UiFlex } from 'mhz-ui';

onMounted(() => {
  document.querySelector('main')?.scrollTo(0, 0);
});
</script>
